Repository: beeware/beeware-tutorial
Catalog: locales/*/LC_MESSAGES/tutorial/topics/camera-access.po
Languages: es

source: Using the camera
es: Usando la cámara

source: This tutorial won't work on all platforms!
es: ¡Este tutorial no funcionará en todas las plataformas!

source: Unfortunately, at present, this tutorial will only work on macOS and Android.
es: Lamentablemente, por el momento, este tutorial solo funcionará en macOS y Android.

source: Although iPhones all have cameras, the iOS *Simulator* doesn't have a working camera. Windows and Linux devices also have cameras, but Toga doesn't currently have the ability to access the camera on these platforms.
es: Aunque todos los iPhone tienen cámaras, el *emulador* de iOS no tiene una cámara que funcione. Los dispositivos Windows y Linux también tienen cámaras, pero Toga actualmente no tiene la capacidad de acceder a la cámara en estas plataformas.

source: The code presented here will *run* on Windows or Linux; but it will raise an error when you try to take a photograph.
es: El código que aquí se muestra *se ejecutará* en Windows o Linux; pero generará un error cuando intentes hacer una foto.

source: The code will work if it is run on an actual iOS device, but will fail to take a photograph if deployed to the iOS simulator.
es: El código funcionará si se ejecuta en un dispositivo iOS real, pero no podrá hacer una foto si se implementa en el emulador de iOS.

source: Start a new project
es: Iniciar un nuevo proyecto

source: For this tutorial, we're not going to build onto the application from the core tutorial - we're going to start a fresh project. You can use the same virtual environment you used in the first project; but we need to re-run the ``briefcase new`` wizard.
es: Para este tutorial, no desarrollaremos la aplicación del tutorial principal, sino que comenzaremos un nuevo proyecto. Puede utilizar el mismo entorno virtual que utilizó en el primer proyecto. Sin embargo, debemos ejecutar nuevamente el asistente Nuevo maletín.

source: Change back to the directory that contains the ``helloworld`` project folder, and start a new project named "Hello Camera":
es: Regrese al directorio que contiene la carpeta del proyecto ``helloworld`` e inicie un nuevo proyecto llamado “Hello Camera”:

source: Add code to take a photo
es: Añade código para tomar una foto

source: The wizard has generated a new empty Toga project. We can now add the code to take and display a photograph. Edit the ``app.py`` for the new application so that it has the following content:
es: El asistente ha generado un nuevo proyecto Toga vacío. Ahora podemos agregar el código para tomar y mostrar una fotografía. Edite el archivo ``app.py`` de la nueva aplicación para que tenga el siguiente contenido:

source: The first highlighted code block (in the ``startup()`` method) adds the two widgets needed to control the camera: an ``ImageView`` to display a photo; and a ``Button`` to trigger the camera.
es: El primer bloque de código resaltado (en el método ``startup()``) agrega los dos widgets necesarios para controlar la cámara: un ``ImageView`` para mostrar una foto; y un ``Button`` para activar la cámara.

source: The second highlighted code block (the ``take_photo()`` method) defines the event handler when the button is pressed. This handler first confirms if the application has permission to take a photo; if permission doesn't exist, it is requested. Then, a photo is taken. The request for permission and the request to take a photo are both asynchronous requests, so they require the use of ``await``; while the app is waiting for the user to confirm permissions or take the photo, the app's event loop can continue in the background.
es: El segundo bloque de código resaltado (el método ``take_photo()``) define el controlador de eventos cuando se presiona el botón. Este controlador primero confirma si la aplicación tiene permiso para tomar una foto; si no existe permiso, se solicita. Luego, se toma una foto. La solicitud de permiso y la solicitud para tomar una foto son ambas solicitudes asincrónicas, por lo que requieren el uso de ``await``; mientras la aplicación espera que el usuario confirme los permisos o tome la foto, el bucle de eventos de la aplicación puede continuar en segundo plano.

source: If the camera successfully takes a photo, it will return an ``Image`` object that can be assigned as the content of the ``ImageView``. If the photo request was canceled by the user, the ``self.camera.take_photo()`` call will return ``None``, and the result can be ignored. If the user doesn't grant permission to use the camera, or the camera isn't implemented on the current platform, an error will be raised, and a dialog will be shown to the user.
es: Si la cámara toma una foto correctamente, devolverá un objeto ``Image`` que se puede asignar como contenido de ``ImageView``. Si el usuario canceló la solicitud de la foto, la llamada ``self.camera.take_photo()`` devolverá ``None`` y el resultado se puede ignorar. Si el usuario no otorga permiso para usar la cámara, o la cámara no está implementada en la plataforma actual, se generará un error y se mostrará un cuadro de diálogo al usuario.

source: Adding device permissions
es: Agregar permisos al dispositivo

source: Part of this code we've just added asks for permission to use the camera. This is a common feature of modern app platforms - you can't access hardware features without explicitly asking the user's permission first.
es: Parte de este código que acabamos de agregar solicita permiso para usar la cámara. Esta es una característica común de las plataformas de aplicaciones modernas: no se puede acceder a las funciones de hardware sin pedirle permiso explícitamente al usuario primero.

source: However, this request comes in two parts. The first is in the code we've just seen; but before the app can ask for permissions, it needs to declare the permissions it is going to ask for.
es: Sin embargo, esta solicitud se presenta en dos partes. La primera se encuentra en el código que acabamos de ver, pero antes de que la aplicación pueda solicitar permisos, necesita declarar los permisos que va a solicitar.

source: This declares that your app needs to access the camera, and provides a short description why the camera is required. This description is needed on some platforms (most notably macOS and iOS) and will be displayed to the user as a additional information when the permission dialog is presented.
es: Esto explica que su aplicación necesita acceder a la cámara y proporciona una breve descripción de por qué se requiere la cámara. Esta descripción es obligatoria en algunas plataformas (en particular, macOS e iOS) y se presenta al usuario como información adicional cuando se muestra el cuadro de diálogo de permisos.

source: We can now generate and run the app:
es: Ahora podemos generar y ejecutar la aplicación:

source: When the app runs, you'll be presented with a button. Press the button, and the platform's default camera dialog will be displayed. Take a photo; the camera dialog will disappear, and the photo will be displayed on in the app, just above the button. You could then take another photo; this will replace the first photo.
es: Cuando se ejecuta la aplicación, se te presentará un botón. Pulsa el botón y se mostrará el cuadro de diálogo de la cámara predeterminada de la plataforma. Toma una foto; el cuadro de diálogo de la cámara desaparecerá y la foto se mostrará en la aplicación, justo encima del botón. Luego, puedes tomar otra foto; esta reemplazará la primera foto.

source: Adding more permissions
es: Agregar más permisos

source: Permissions are declared in the files that are generated during the original call to ``briefcase create``. Unfortunately, Briefcase can't update these files once they've been initially generated; so if you want to add a new permission to your app, or modify existing permissions, you'll need to re-create the app. You can do this by re-running ``briefcase create``; this will warn you that the existing app will be overwritten, and then regenerate the application with the new permissions.
es: Los permisos se declaran en los archivos que se generan durante la llamada original a ``briefcase create``. Lamentablemente, Briefcase no puede actualizar estos archivos una vez que se han generado inicialmente; por lo tanto, si desea agregar un nuevo permiso a su aplicación o modificar los permisos existentes, deberá volver a crear la aplicación. Puede hacerlo volviendo a ejecutar ``briefcase create``; esto le advertirá que la aplicación existente se sobrescribirá y luego regenerará la aplicación con los nuevos permisos.
