Repository: beeware/beeware-tutorial
Catalog: locales/*/LC_MESSAGES/tutorial/tutorial-1.po
Languages: fr, pt, zh_tw

source: Tutorial 1 - Your first app
fr: Tutoriel 1 - Votre première application
pt: Tutorial 1 - Seu primeiro app
zh_tw: 教學 1 - 您的第一個應用程式

source: We're ready to create our first application.
fr: Nous sommes prêts à créer notre première application.
pt: Estamos prontos para criar nossa primeira aplicação.
zh_tw: 我們已準備好創建我們的第一個應用程式。

source: Install the BeeWare tools
fr: Installer les outils BeeWare
pt: Instale as ferramentas do BeeWare
zh_tw: 安裝 BeeWare 工具

source: First, we need to install **Briefcase**. Briefcase is a BeeWare tool that can be used to package your application for distribution to end users - but it can also be used to bootstrap a new project. Make sure you're in the ``beeware-tutorial`` directory you created in :doc:`Tutorial 0 <tutorial-0>`, with the ``beeware-venv`` virtual environment activated, and run:
fr: Tout d'abord, nous devons installer **Briefcase**. Briefcase est un outil BeeWare qui peut être utilisé pour empaqueter votre application afin de la distribuer aux utilisateurs finaux – mais il peut également être utilisé pour démarrer un nouveau projet. Assurez-vous d'être dans le répertoire ``beeware-tutorial`` que vous avez créé lors du :doc:`Tutorial 0 <tutorial-0>`, avec l'environnement virtuel ``beeware-venv`` activé, et exécutez :
pt: Primeiro, precisamos instalar o **Briefcase**. Briefcase é uma ferramenta do BeeWare que pode ser usada para empacotar sua aplicação para distribuição aos usuários finais - mas também pode ser usada para iniciar um novo projeto. Certifique-se de estar no diretório ``beeware-tutorial`` que você criou no :doc:`Tutorial 0 <tutorial-0>`, com o ambiente virtual ``beeware-venv`` ativado, e execute:
zh_tw: 首先，我們需要安裝 **Briefcase**。 它是一個 BeeWare 工具，可用於打包應用程式以分發給最終用戶 - 但它也可用於引導新專案。確保您位於 :doc:`教學 0 <tutorial-0>` 中建立的 ``beeware-tutorial`` 目錄中，啟動 ``beeware-venv`` 虛擬環境，然後執行：

source: Possible errors during installation
fr: Erreurs possibles lors de l'installation
pt: Possíveis erros durante a instalação
zh_tw: 安裝過程中可能出現的錯誤

source: If you see errors during installation, it's almost certainly because some of the system requirements haven't been installed. Make sure you have :ref:`installed all the platform pre-requisites <install-dependencies>`.
fr: Si vous rencontrez des erreurs pendant l'installation, c'est très certainement parce que certains des prérequis du système n'ont pas été installés. Assurez-vous d'avoir :ref:`installé tous les prérequis de la plateforme <install-dependencies>`.
pt: Se você encontrar erros durante a instalação, é bem provável que alguns dos requisitos do sistema não estejam instalados. Certifique-se de ter :ref:`instalado todas os pré-requisitos da plataforma <install-dependencies>`.
zh_tw: 如果您在安裝過程中看到錯誤，幾乎可以肯定是因為某些系統需求尚未安裝。確保您 :ref:`已安裝所有平台先決條件 <install-dependencies>`。

source: It is important that you use ``python -m pip``, rather than a bare ``pip``. Briefcase needs to ensure that it has an up-to-date version of ``pip`` and ``setuptools``, and a bare invocation of ``pip`` can't self-update. If you want to know more, `Brett Cannon has a detailed blog post about the issue <https://snarky.ca/why-you-should-use-python-m-pip/>`__.
fr: Il est important que vous utilisiez ``python -m pip``, plutôt qu'un simple ``pip``. Briefcase doit s'assurer qu'il a une version à jour de ``pip`` et de ``setuptools``, et une simple utilisation de ``pip`` ne peut pas se mettre à jour d'elle-même. Si vous voulez en savoir plus, `Brett Cannon a publié un billet de blog détaillé sur ce sujet <https://snarky.ca/why-you-should-use-python-m-pip/>`__.
pt: É importante usar o comando ``python -m pip``, em vez de apenas ``pip``. Isso porque o Briefcase precisa garantir que as versões do ``pip`` e ``setuptools`` estejam atualizadas, pois o ``pip`` usado sozinho não consegue se atualizar. Se quiser entender melhor o motivo, o `Brett Cannon escreveu um post detalhado no blog dele <https://snarky.ca/why-you-should-use-python-m-pip/>`__.
zh_tw: 使用 ``python -m pip`` ，而不是只有 ``pip`` ，這一點很重要。 Briefcase需要確保它有最新版本的 ``pip`` 和 ``setuptools`` ，並且單純調用 ``pip`` 無法自我更新。如果您想了解更多信息，`Brett Cannon 有一篇關於該問題的詳細博客文章 <https://snarky.ca/why-you-should-use-python-m-pip/>`__ 。

source: Bootstrap a new project
fr: Créer un nouveau projet
pt: Iniciar um novo projeto
zh_tw: 開始一個新項目

source: Let's start our first BeeWare project! We're going to use the Briefcase ``new`` command to create an application called **Hello World**. Run the following from your command prompt:
fr: Commençons notre premier projet BeeWare ! Nous allons utiliser la commande ``new`` de Briefcase pour créer une application appelée **Hello World**. Exécutez la commande suivante à partir de votre invite de commande :
pt: Vamos começar nosso primeiro projeto BeeWare! Usaremos o comando ``new`` do Briefcase para criar um aplicativo chamado **Hello World**. Execute o seguinte comando no seu prompt de comando/terminal:
zh_tw: 讓我們開始我們的第一個 BeeWare 專案吧！我們將使用 Briefcase 的 ``new`` 命令建立一個名為 **Hello World** 的應用程式。從命令提示字元執行以下命令：

source: Briefcase will ask us for some details of our new application. For the purposes of this tutorial, use the following:
fr: Briefcase nous demandera quelques détails sur notre nouvelle application. Pour les besoins de ce tutoriel, nous utiliserons les éléments suivants :
pt: O Briefcase solicitará alguns detalhes sobre nosso novo aplicativo. Para os propósitos deste tutorial, utilize o seguinte:
zh_tw: Briefcase 將詢問我們新應用程式的一些詳細資訊。出於本教學的目的，請使用以下內容：

source: **Formal Name** - Accept the default value: ``Hello World``.
fr: **Formal Name** (Nom formel) – Acceptez la valeur par défaut : ``Hello World``.
pt: **Formal Name** - Aceite o valor padrão: ``Hello World``.
zh_tw: **正式名稱** - 接受預設值： ``Hello World`` 。

source: **App Name** - Accept the default value: ``helloworld``.
fr: **App Name** (Nom de l'application) - Acceptez la valeur par défaut : ``helloworld``.
pt: **App Name** - Aceite o valor padrão: ``helloworld``.
zh_tw: **應用程式名稱** - 接受預設值： ``helloworld`` 。

source: **Project Name** - Accept the default value: ``Hello World``.
fr: **Project Name** (Nom du projet) - Acceptez la valeur par défaut : ``Hello World``.
pt: **Project Name** - Aceite o valor padrão: ``Hello World``.
zh_tw: **項目名稱** - 接受預設值： ``Hello World`` 。

source: **Description** - Accept the default value (or, if you want to be really creative, come up with your own description!)
pt: **Description** - Aceite o valor padrão (ou, se quiser ser realmente criativo, crie sua própria descrição!)
zh_tw: **描述** - 接受預設值（或者，如果您想真正發揮創意，請提出您自己的描述！）

source: **Author** - Enter your own name here.
fr: ** Author** (Auteur) - Entrez votre propre nom ici.
pt: **Author** - Insira seu próprio nome.
zh_tw: **作者** - 在此輸入您自己的姓名。

source: **GUI framework** - Accept the default option, Toga (BeeWare's own GUI toolkit).
fr: **GUI framework** (framework d'interface utilisateur graphique) - Acceptez l'option par défaut, Toga (la boîte à outils GUI de BeeWare).
pt: **GUI framework** - Aceite a opção padrão, Toga (a própria biblioteca de interface gráfica da BeeWare).
zh_tw: **GUI 框架** - 接受預設選項 Toga（BeeWare 自己的 GUI 工具）。

source: Briefcase will then generate a project skeleton for you to use. If you've followed this tutorial so far, and accepted the defaults as described, your file system should look something like::
fr: Briefcase va alors générer un squelette de projet que vous pourrez utiliser. Si vous avez suivi ce tutoriel jusqu'ici, et accepté les paramètres par défaut tels que décrits, votre système de fichiers devrait ressembler à quelque chose comme ceci :
pt: O Briefcase então gerará uma estrutura básica de projeto para você usar. Se você seguiu este tutorial até agora e aceitou as configurações padrão como descrito, seu sistema de arquivos deve se parecer com algo assim:
zh_tw: 然後，Briefcase 將產生一個專案框架供您使用。如果您到目前為止已經遵循了本教學，並接受了所描述的預設設置，您的資料夾應該類似於：

source: This skeleton is actually a fully functioning application without adding anything else. The ``src`` folder contains all the code for the application, the ``tests`` folder contains an initial test suite, and the ``pyproject.toml`` file describes how to package the application for distribution. If you open ``pyproject.toml`` in an editor, you'll see the configuration details you just provided to Briefcase.
fr: Ce squelette est en fait une application pleinement fonctionnelle, sans avoir rien à ajouter d'autre. Le dossier ``src`` contient tout le code de l'application, le dossier ``tests`` contient une suite de tests initiale, et le fichier ``pyproject.toml`` décrit comment empaqueter l'application pour la distribuer. Si vous ouvrez ``pyproject.toml`` dans un éditeur, vous verrez les détails de la configuration que vous venez de fournir à Briefcase.
pt: Essa estrutura atual já é um aplicativo totalmente funcional sem adicionar mais nada. A pasta ``src`` contém todo o código do aplicativo, a pasta ``tests`` contém uma suíte de testes inicial, e o arquivo ``pyproject.toml`` descreve como empacotar o aplicativo para distribuição. Se você abrir o ``pyproject.toml`` em um editor, verá os detalhes de configuração que você acabou de fornecer ao Briefcase.
zh_tw: 這個框架實際上是一個功能齊全的應用程式，無需添加任何其他內容。 ``src`` 資料夾包含應用程式的所有程式碼， ``tests`` 資料夾包含初始測試套件， ``pyproject.toml`` 檔案描述如何打包應用程式以進行分發。如果您在編輯器中開啟 ``pyproject.toml`` ，您將看到剛剛提供給 ``Briefcase`` 的設定詳細資訊。

source: Now that we have a stub application, we can use Briefcase to run the application.
fr: Maintenant que nous avons une ébauche d'application, nous pouvons utiliser Briefcase pour l'exécuter.
pt: Agora que temos um aplicativo inicial, podemos usar o Briefcase para executar a aplicação.
zh_tw: 現在我們有了一個未打包的應用程式，我們可以使用 Briefcase 來運行該應用程式。

source: Run the app in developer mode
fr: Exécuter l'application en mode développeur
pt: Inicie o app no modo de desenvolvedor
zh_tw: 在開發者模式下運行應用程式

source: Move into the ``helloworld`` project directory and tell briefcase to start the project in Developer (or ``dev``) mode:
fr: Entrez dans le répertoire du projet ``helloworld`` et faites démarrer le projet en mode développeur (ou ``dev``) par briefcase :
pt: Vá para o diretório do projeto ``helloworld`` e peça ao Briefcase para iniciar o projeto no modo de Desenvolvedor (ou ``dev``):
zh_tw: 進入 ``helloworld`` 專案目錄並告訴公事包以開發人員（或 ``dev`` ）模式啟動專案：

source: This should open a GUI window:
fr: Cela devrait ouvrir une fenêtre GUI :
pt: Isso deve abrir uma janela GUI:
zh_tw: 這應該打開一個 GUI 視窗：

source: Hello World Tutorial 1 window, on macOS
fr: Fenêtre Tutoriel 1 Hello World, sur macOS
pt: Janela do Tutorial 1 ``Hello World``, no macOS
zh_tw: 在 macOS 上的教學 1 視窗

source: Hello World Tutorial 1 window, on Linux
fr: Fenêtre Tutoriel 1 Hello World, sous Linux
pt: Janela do Tutorial 1 ``Hello World``, no Linux
zh_tw: 在 Linux 上的教學 1 視窗

source: Hello World Tutorial 1 window, on Windows
fr: Fenêtre Tutoriel 1 Hello World, sur Windows
pt: Janela do Tutorial 1 ``Hello World``, no Windows
zh_tw: 在 Windows 上的教學 1 視窗

source: Next steps
fr: Étapes suivantes
pt: Próximos passos
zh_tw: 下一步

source: We now have a working application, running in developer mode. Now we can add some logic of our own to make our application do something a little more interesting. In :doc:`Tutorial 2 <tutorial-2>`, we'll put a more useful user interface onto our application.
fr: Nous avons maintenant une application fonctionnelle, s'exécutant en mode développeur. Nous pouvons maintenant ajouter notre propre logique pour que notre application fasse quelque chose d'un peu plus intéressant. Dans :doc:`Tutoriel 2 <tutorial-2>`, nous allons ajouter à notre application une interface utilisateur plus utile.
pt: Agora temos um aplicativo funcional, em execução no modo de desenvolvedor. Podemos adicionar alguma lógica própria para tornar nosso aplicativo um pouco mais interessante. No :doc:`Tutorial 2 <tutorial-2>`, vamos colocar uma interface de usuário mais útil em nossa aplicação.
zh_tw: 我們現在有了一個可以運行的應用程序，在開發人員模式下運行。現在我們可以添加一些我們自己的邏輯，使我們的應用程式做一些更有趣的事情。在 :doc:`教程 2 中<tutorial-2>`，我們將在我們的應用程式中放置一個更有用的使用者介面。
