Repository: beeware/beeware-tutorial
Catalog: locales/*/LC_MESSAGES/tutorial/tutorial-2.po
Languages: fr, pt

source: Tutorial 2 - Making it interesting
fr: Tutoriel 2 - Rendre les choses intéressantes
pt: Tutorial 2 - Tornando as coisas interessantes

source: In :doc:`Tutorial 1 <tutorial-1>`, we generated a stub project that was able to run, but we didn't write any code ourselves. Let's take a look at what was generated for us.
fr: Dans le :doc:`Tutoriel 1 <tutorial-1>`, nous avons généré une ébauche de projet capable de s'exécuter, mais nous n'avons pas écrit de code nous-mêmes. Jetons un coup d'œil à ce qui a été généré pour nous.
pt: No :doc:`Tutorial 1 <tutorial-1>`, geramos um projeto inicial que executava, mas não escrevemos nenhum código por conta própria. Vamos dar uma olhada no que foi criado para nós.

source: What was generated
fr: Ce qui a été généré
pt: O que foi gerado

source: In the ``src/helloworld`` directory, you should see 3 files: ``__init__.py``, ``__main__.py`` and ``app.py``.
fr: Dans le répertoire ``src/helloworld``, vous devriez voir 3 fichiers : ``__init__.py``, ``__main__.py`` et ``app.py``.
pt: No diretório ``src/helloworld``, você deverá ver 3 arquivos: ``__init__.py``, ``__main__.py`` e ``app.py``.

source: ``__init__.py`` marks the ``helloworld`` directory as an importable Python module. It is an empty file; the very fact it exists tells the Python interpreter that the ``helloworld`` directory defines a module.
fr: ``__init__.py`` marque le répertoire ``helloworld`` comme un module Python importable. C'est un fichier vide ; le simple fait qu'il existe indique à l'interpréteur Python que le répertoire ``helloworld`` définit un module.
pt: ``__init__.py`` torna o diretório ``helloworld`` um módulo Python importável. Trata-se de um arquivo vazio; sua simples existência indica ao interpretador Python que há um módulo definido pelo diretório `helloworld`.

source: ``__main__.py`` marks the ``helloworld`` module as a special kind of module - an executable module. If you try to run the ``helloworld`` module using ``python -m helloworld``, the ``__main__.py`` file is where Python will start executing. The contents of ``__main__.py`` is relatively simple::
fr: Le fichier ``__main__.py`` marque le module ``helloworld`` comme un type spécial de module - un module exécutable. Si vous essayez d'exécuter le module ``helloworld'' en utilisant ``python -m helloworld'', le fichier ``__main__.py`` est l'endroit où Python commencera à s'exécuter. Le contenu de `__main__.py`` est relativement simple :
pt: ``__main__.py`` define o módulo ``helloworld`` como um tipo especial de módulo - um módulo executável. Ao tentar executar o módulo ``helloworld`` usando ``python -m helloworld``, o Python iniciará a execução no arquivo ``__main__.py``. O conteúdo de ``__main__.py`` é relativamente simples::

source: The more interesting file is ``app.py`` - this contains the logic that creates our application window::
fr: Le fichier le plus intéressant est ``app.py`` - il contient la logique responsable de la création de notre fenêtre d'application :
pt: O arquivo mais interessante é o ``app.py`` - nele está contido a lógica que cria a janela da nossa aplicação::

source: Let's go through this line by line::
fr: Examinons-le ligne par ligne :
pt: Vamos analisar isso linha por linha::

source: Then, we define a class::
fr: Ensuite, nous définissons une classe :
pt: Em seguida, definimos uma classe::

source: Each Toga application has a single ``toga.App`` instance, representing the running entity that is the application. The app may end up managing multiple windows; but for simple applications, there will be a single main window.
fr: Chaque application Toga possède une seule instance ``toga.App``, représentant l'entité en cours d'exécution, c'est-à-dire notre application. L'application peut gérer plusieurs fenêtres, mais pour les applications simples, il n'y aura qu'une seule fenêtre principale.
pt: Cada aplicação Toga possui uma única instância chamada ``toga.App``, que representa o aplicativo em si sendo executado. A aplicação pode acabar gerenciando várias janelas; mas para aplicativos simples, haverá uma única janela principal.

source: Next, we define a ``startup()`` method::
fr: Ensuite, nous définissons une méthode de démarrage ``startup()`` :
pt: Depois, definimos um método chamado ``startup()``::

source: The first thing the startup method does is to define a main box. Toga's layout scheme behaves similar to HTML. You build an application by constructing a collection of boxes, each of which contains other boxes, or actual widgets. You then apply styles to these boxes to define how they will consume the available window space.
fr: La première chose que fait la méthode de démarrage est de définir une boîte principale. Le schéma de présentation de Toga est similaire à celui du HTML. Vous construisez une application en construisant une collection de boîtes, chacune d'entre elles contenant d'autres boîtes, ou de véritables widgets. Vous appliquez ensuite des styles à ces boîtes pour définir la manière dont elles utiliseront l'espace disponible dans la fenêtre.
pt: A primeira coisa que o método startup() faz é definir um container principal. O esquema de layout do Toga se comporta de maneira semelhante ao HTML. A construção de uma aplicação se dá por meio da criação de uma coleção de containers, cada um contendo outros containers ou os widgets propriamente dito. Depois, você aplica estilos a esses containers para definir como vão usar o espaço na janela.

source: In this application, we define a single box, but we don't put anything into it.
fr: Dans cette application, nous définissons une seule boîte, mais nous n'y mettons rien.
pt: Neste aplicativo, definimos um único container, mas não colocamos nada dentro dele.

source: Next, we define a window into which we can put this empty box::
fr: Ensuite, nous définissons une fenêtre dans laquelle nous pouvons placer cette boîte vide :
pt: Em seguida, definimos uma janela na qual podemos colocar o container vazio::

source: We then add our empty box as the content of the main window, and instruct the application to show our window::
fr: Nous ajoutons ensuite notre boîte vide au contenu de la fenêtre principale et demandons à l'application d'afficher notre fenêtre :
pt: Então, adicionamos nosso container vazio como conteúdo da janela principal e instruímos o aplicativo a mostrar nossa janela::

source: This ``main()`` method is the one that is imported and invoked by ``__main__.py``. It creates and returns an instance of our ``HelloWorld`` application.
fr: Cette méthode ``main()`` est celle qui est importée et invoquée par ``main__.py``. Elle crée et retourne une instance de notre application ``HelloWorld``.
pt: O método ``main()`` é aquele que é importado e chamado pelo arquivo ``__main__.py``. Ele cria e retorna uma instância da nossa aplicação ``HelloWorld``.

source: That's the simplest possible Toga application. Let's put some of our own content into the application, and make the app do something interesting.
fr: C'est l'application Toga la plus simple possible. Bous allons ajouter notre propre contenu à l'application, et faire en sorte qu'elle fasse quelque chose de plus intéressant.
pt: Essa é a aplicação Toga mais básica possível. Vamos agora integrar conteúdo personalizado à aplicação e torná-la mais interessante.

source: Adding some content of our own
fr: Ajouter notre propre contenu
pt: Adicionando conteúdo personalizado

source: Modify your ``HelloWorld`` class inside ``src/helloworld/app.py`` so that it looks like this::
fr: Modifiez votre classe ``HelloWorld`` dans ``src/helloworld/app.py`` pour qu'elle ressemble à ceci :
pt: Modifique sua classe ``HelloWorld`` dentro de ``src/helloworld/app.py`` para que fique assim:

source: Let's look in detail at what has changed.
fr: Examinons en détail ce qui a changé.
pt: Vamos ver em detalhes o que mudou.

source: We're still creating a main box; however, we are now applying a style::
fr: Nous sommes toujours en train de créer une boîte principale, mais nous appliquons maintenant un style :
pt: Ainda estamos fazendo o container principal; porém, agora estamos aplicando um estilo::

source: Next, we define a couple of widgets::
fr: Ensuite, nous définissons quelques widgets :
pt: A seguir, vamos definir dois widgets::

source: The TextInput is assigned as an instance variable of the class. This gives us easy access to the widget instance - something that we'll use in a moment.
fr: Le TextInput est assigné en tant que variable d'instance d classe. Cela nous permet d'accéder facilement à l'instance du widget, ce que nous utiliserons dans un instant.
pt: O TextInput é atribuído como uma variável de instância da classe. Isso nos permite acessar facilmente a instância do widget, o que será utilizado em breve.

source: Next, we define a box to hold these two widgets::
fr: Ensuite, nous définissons une boîte pour contenir ces deux widgets :
pt: Após isso, definimos um container para colocar esses dois widgets::

source: Now we define a button::
fr: Nous définissons maintenant un bouton :
pt: Agora definimos um botão::

source: Then, we add the name box and the button to the main box::
fr: Ensuite, nous ajoutons la boîte de nom et le bouton à la boîte principale :
pt: Então, adicionamos o container name_box e o botão ao container principal::

source: The body of the method is a simple print statement - however, it will interrogate the current value of the name input, and use that content as the text that is printed.
fr: Le corps de la méthode est une simple instruction d'affichage (print). Cependant, elle interroge la valeur actuelle de l'entrée name et utilise ce contenu comme texte à imprimer.
pt: O corpo do método é uma simples instrução de impressão. No entanto, ele consultará o valor atual do campo de entrada de nome e usará esse conteúdo como o texto a ser impresso.

source: Now that we've made these changes we can see what they look like by starting the application again. As before, we'll use developer mode:
fr: Maintenant que nous avons effectué ces changements, nous pouvons voir à quoi ils ressemblent en relançant l'application. Comme précédemment, nous utiliserons le mode développeur :
pt: Ao concluirmos essas alterações, podemos visualizar o resultado reiniciando a aplicação. Seguindo o procedimento anterior, utilizaremos o modo de desenvolvedor:

source: This should open a GUI window:
fr: Cela devrait ouvrir une fenêtre GUI :
pt: Isso deve abrir uma janela GUI:

source: Hello World Tutorial 2 window, on macOS
fr: Fenêtre Hello World Tutorial 2, sur macOS
pt: Tutorial 2: Janela "Hello World", no macOS

source: Hello World Tutorial 2 window, on Linux
fr: Fenêtre Hello World Tutorial 2, sous Linux
pt: Tutorial 2: Janela "Hello World", no Linux

source: Hello World Tutorial 2 window, on Windows
fr: Fenêtre Hello World Tutorial 2, sur Windows
pt: Tutorial 2: Janela "Hello World", no Windows

source: If you enter a name in the text box, and press the GUI button, you should see output appear in the console where you started the application.
fr: Si vous saisissez un nom dans la zone de texte et que vous appuyez sur le bouton GUI, vous devriez voir apparaître une sortie dans la console où vous avez démarré l'application.
pt: Se você escrever um nome na caixa de texto e clicar no botão da interface, vai ver uma mensagem aparecer no console onde você abriu a aplicação.

source: Next steps
fr: Étapes suivantes
pt: Próximos passos

source: We've now got an application that does something a little more interesting. But it only runs on our own computer. Let's package this application for distribution. In :doc:`Tutorial 3 <tutorial-3>`, we'll wrap our application up as a standalone installer that we could send to a friend, a customer, or upload to an App Store.
fr: Nous avons maintenant une application qui fait quelque chose d'un peu plus intéressant. Mais elle ne fonctionne que sur notre propre ordinateur. Allons empaqueter cette application pour la distribuer. Dans :doc:`Tutoriel 3 <tutorial-3>`, nous allons empaqueter notre application sous la forme d'un programme d'installation autonome que nous pourrons envoyer à un ami, un client, ou télécharger sur un App Store.
pt: Criamos uma aplicação com recursos mais interessantes. Porém, ela somente funciona em nosso computador. Vamos empacotar esta aplicação para distribuição. No :doc:`Tutorial 3 <tutorial-3>`, encapsularemos nossa aplicação em um instalador independente, que poderemos enviar a amigos, clientes ou publicar em uma App Store.
