Repository: beeware/beeware-tutorial
Catalog: locales/*/LC_MESSAGES/tutorial/tutorial-5/android.po
Languages: es

source: Tutorial 5 - Taking it mobile: Android
es: Tutorial 5 - Movilidad: Android

source: Now, we're going to take our application, and deploy it as an Android application.
es: Ahora, vamos a tomar nuestra aplicación, y desplegarla como una aplicación Android.

source: The process of deploying an application to Android is very similar to the process for deploying as a desktop application. Briefcase handles installing dependencies for Android, including the Android SDK, the Android emulator, and a Java compiler.
es: El proceso de despliegue de una aplicación en Android es muy similar al proceso de despliegue como aplicación de escritorio. Briefcase se encarga de instalar las dependencias para Android, incluyendo el SDK de Android, el emulador de Android y un compilador de Java.

source: Create an Android app and compile it
es: Crear una aplicación Android y compilarla

source: First, run the ``create`` command. This downloads an Android app template and adds your Python code to it.
es: Primero, ejecuta el comando ``create``. Esto descarga una plantilla de aplicación Android y le añade tu código Python.

source: Once this completes, we'll have a ``build\helloworld\android\gradle`` directory in our project, which will contain an Android project with a Gradle build configuration. This project will contain your application code, and a support package containing the Python interpreter.
es: Una vez completado esto, tendremos un directorio ``build\helloworld\android\gradle`` en nuestro proyecto, que contendrá un proyecto Android con una configuración de construcción Gradle. Este proyecto contendrá el código de la aplicación, y un paquete de soporte que contiene el intérprete de Python.

source: We can then use Briefcase's ``build`` command to compile this into an Android APK app file.
es: A continuación, podemos utilizar el comando ``build`` de Briefcase para compilar esto en un archivo de aplicación Android APK.

source: Gradle may look stuck
es: Gradle puede parecer atascado

source: During the ``briefcase build android`` step, Gradle (the Android platform build tool) will print ``CONFIGURING: 100%``, and appear to be doing nothing. Don't worry, it's not stuck - it's downloading more Android SDK components. Depending on your Internet connection speed, this may take another 10 minutes (or longer). This lag should only happen the very first time you run ``build``; the tools are cached, and on your next build, the cached versions will be used.
es: Durante el paso ``briefcase build android``, Gradle (la herramienta de compilación de la plataforma Android) imprimirá ``CONFIGURING: 100%``, y parecerá que no está haciendo nada. No te preocupes, no está atascado - está descargando más componentes del SDK de Android. Dependiendo de la velocidad de su conexión a Internet, esto puede tardar otros 10 minutos (o más). Este retraso sólo debería ocurrir la primera vez que ejecutes ``build``; las herramientas se almacenan en caché, y en tu próxima compilación, se utilizarán las versiones almacenadas en caché.

source: Run the app on a virtual device
es: Ejecutar la aplicación en un dispositivo virtual

source: We're now ready to run our application. You can use Briefcase's ``run`` command to run the app on an Android device. Let's start by running on an Android emulator.
es: Ahora estamos listos para ejecutar nuestra aplicación. Puedes utilizar el comando ``run`` de Briefcase para ejecutar la aplicación en un dispositivo Android. Empecemos ejecutando en un emulador de Android.

source: To run your application, run ``briefcase run android``. When you do this, you'll be prompted with a list of devices that you could run the app on. The last item will always be an option to create a new Android emulator.
es: Para ejecutar tu aplicación, ejecuta ``briefcase run android``. Al hacerlo, se te pedirá una lista de dispositivos en los que podrías ejecutar la aplicación. El último elemento será siempre una opción para crear un nuevo emulador de Android.

source: We can now choose our desired device. Select the "Create a new Android emulator" option, and accept the default choice for the device name (``beePhone``).
es: Ahora podemos elegir el dispositivo deseado. Selecciona la opción "Crear un nuevo emulador de Android", y acepta la opción por defecto para el nombre del dispositivo (``beePhone``).

source: Briefcase ``run`` will automatically boot the virtual device. When the device is booting, you will see the Android logo:
es: Briefcase ``run`` arrancará automáticamente el dispositivo virtual. Cuando el dispositivo esté arrancando, verás el logo de Android:

source: Android virtual device booting
es: Arranque del dispositivo virtual Android

source: Once the device has finished booting, Briefcase will install your app on the device. You will briefly see a launcher screen:
es: Una vez que el dispositivo haya terminado de arrancar, Briefcase instalará tu aplicación en el dispositivo. Verás brevemente una pantalla de inicio:

source: Android virtual device fully started, on the launcher screen
es: Dispositivo virtual Android totalmente iniciado, en la pantalla del lanzador

source: The app will then start. You'll see a splash screen while the app starts up:
es: La aplicación se iniciará. Verás una pantalla de bienvenida mientras se inicia la aplicación:

source: App splash screen
es: Pantalla de inicio de la aplicación

source: The emulator didn't start!
es: ¡El emulador no arranca!

source: The Android emulator is a complex piece of software that relies on a number of hardware and operating system features - features that may not be available or enabled on older machines. If you experience any difficulties starting the Android emulator, consult the `Requirements and recommendations <https://developer.android.com/studio/run/emulator#requirements>`__ section of the Android developer documentation.
es: El emulador de Android es un software complejo que depende de una serie de características del hardware y del sistema operativo, características que pueden no estar disponibles o habilitadas en máquinas más antiguas. Si tiene dificultades para iniciar el emulador de Android, consulte la sección `Requerimientos y recomendaciones <https://developer.android.com/studio/run/emulator#requirements>`__ de la documentación para desarrolladores de Android.

source: The first time the app starts, it needs to unpack itself onto the device. This may take a few seconds. Once it's unpacked, you'll see the Android version of our desktop app:
es: La primera vez que se inicia la aplicación, tiene que desempaquetarse en el dispositivo. Esto puede tardar unos segundos. Una vez desempaquetada, verás la versión para Android de nuestra aplicación de escritorio:

source: App from Tutorial 2, fully launched
es: Aplicación del Tutorial 2, totalmente lanzada

source: Demo app fully launched
es: Lanzamiento completo de la aplicación de demostración

source: If you fail to see your app launching, you may need to check your terminal where you ran ``briefcase run`` and look for any error messages.
es: Si no ves que tu aplicación se inicia, es posible que tengas que comprobar el terminal donde ejecutaste ``briefcase run`` y buscar cualquier mensaje de error.

source: In future, if you want to run on this device without using the menu, you can provide the emulator's name to Briefcase, using ``briefcase run android -d "@beePhone"`` to run on the virtual device directly.
es: En el futuro, si deseas ejecutar en este dispositivo sin usar el menú, puedes proporcionar el nombre del emulador a Briefcase, usando ``briefcase run android -d "@beePhone"`` para ejecutar en el dispositivo virtual directamente.

source: Run the app on a physical device
es: Ejecutar la aplicación en un dispositivo físico

source: If you have a physical Android phone or tablet, you can connect it to your computer with a USB cable, and then use the Briefcase to target your physical device.
es: Si tienes un teléfono o tableta Android físicos, puedes conectarlos a tu ordenador con un cable USB y, a continuación, utilizar el Maletín para apuntar a tu dispositivo físico.

source: Android requires that you prepare your device before it can be used for development. You will need to make 2 changes to the options on your device:
es: Android requiere que prepares tu dispositivo antes de que pueda ser utilizado para el desarrollo. Tendrás que realizar 2 cambios en las opciones de tu dispositivo:

source: Enable developer options
es: Activar opciones de desarrollador

source: Enable USB debugging
es: Activar la depuración USB

source: Details on how to make these changes can be found `in the Android developer documentation <https://developer.android.com/studio/debug/dev-options#enable>`__.
es: Los detalles sobre cómo realizar estos cambios se pueden encontrar `en la documentación para desarrolladores de Android <https://developer.android.com/studio/debug/dev-options#enable>`__.

source: Once these steps have been completed, your device should appear in the list of available devices when you run ``briefcase run android``.
es: Una vez completados estos pasos, tu dispositivo debería aparecer en la lista de dispositivos disponibles cuando ejecutes ``briefcase run android``.

source: Here we can see a new physical device with it's serial number on the deployment list - in this case, a Pixel 3a. In the future, if you want to run on this device without using the menu, you can provide the phone's serial number to Briefcase (in this case, ``briefcase run android -d 94ZZY0LNE8``). This will run on the device directly, without prompting.
es: Aquí podemos ver un nuevo dispositivo físico con su número de serie en la lista de despliegue - en este caso, un Pixel 3a. En el futuro, si desea ejecutar en este dispositivo sin utilizar el menú, puede proporcionar el número de serie del teléfono a Briefcase (en este caso, ``briefcase run android -d 94ZZY0LNE8``). Esto se ejecutará en el dispositivo directamente, sin preguntar.

source: My device doesn't appear!
es: ¡Mi dispositivo no aparece!

source: If your device doesn't appear on this list at all, either you haven't enabled USB debugging, (or the device isn't plugged in!).
es: Si tu dispositivo no aparece en esta lista, significa que no has activado la depuración USB (o que el dispositivo no está conectado).

source: If your device appears, but is listed as "Unknown device (not authorized for development)", developer mode hasn't been correctly enabled. Re-run `the steps to enable developer options <https://developer.android.com/studio/debug/dev-options#enable>`__, and re-run ``briefcase run android``.
es: Si su dispositivo aparece, pero aparece como "Dispositivo desconocido (no autorizado para el desarrollo)", el modo de desarrollador no se ha habilitado correctamente. Vuelve a ejecutar `los pasos para habilitar las opciones de desarrollador <https://developer.android.com/studio/debug/dev-options#enable>`__, y vuelve a ejecutar ``briefcase run android``.

source: Next steps
es: Siguientes pasos

source: We've now got an application on our phone! Is there anywhere else we can deploy a BeeWare app? Turn to :doc:`Tutorial 6 <../tutorial-6>` to find out...
es: ¡Ya tenemos una aplicación en nuestro teléfono! ¿Hay algún otro lugar donde podamos desplegar una aplicación BeeWare? Visita :doc:`Tutorial 6 <../tutorial-6>` para averiguarlo...
