Repository: beeware/beeware-tutorial
Catalog: locales/*/LC_MESSAGES/tutorial/tutorial-5/iOS.po
Languages: es

source: Tutorial 5 - Taking it mobile: iOS
es: Tutorial 5 - Para móviles: iOS

source: The process of deploying an application to iOS is very similar to the process for deploying as a desktop application. First, you run the ``create`` command - but this time, we specify that we want to create an iOS application:
es: El proceso de implementación de una aplicación en iOS es muy similar al proceso de implementación como aplicación de escritorio. Primero, ejecuta el comando ``create``, pero esta vez especificamos que queremos crear una aplicación para iOS:

source: Once this completes, we'll have a ``build/helloworld/ios/xcode`` directory containing an Xcode project, as well as the support libraries and the application code needed for the application.
es: Una vez que esto se complete, tendremos un directorio ``build/helloworld/ios/xcode`` que contiene un proyecto Xcode, así como las bibliotecas de soporte y el código de aplicación necesario para la aplicación.

source: You can then use Briefcase to compile your app using ``briefcase build iOS``:
es: Luego puedes usar Briefcase para compilar tu aplicación usando ``briefcase build iOS`` (compilar para iOS con Briefcase):

source: We're now ready to run our application, using ``briefcase run iOS``. You'll be prompted to select a device to compile for; if you've got simulators for multiple iOS SDK versions installed, you may also be asked which iOS version you want to target. The options you are shown may differ from the options show in this output - at the very least, the list of devices will likely be different. For our purposes, it doesn't matter which simulator you pick.
es: Ya estamos listos para ejecutar nuestra aplicación, utilizando ``briefcase run iOS`` (ejecutar iOS con Briefcase). Se te pedirá que selecciones un dispositivo para el cual puedes compilar; si tienes instalados simuladores para varias versiones del SDK de iOS, puede que también se te pregunte a qué versión de iOS quieres apuntar. Las opciones que se le muestren pueden diferir de las que se muestran en esta salida; como mínimo, es probable que la lista de dispositivos sea diferente. Para fines prácticos, no importa qué simulador se elija.

source: This will start the iOS simulator, install your app, and start it. You should see the simulator start, and eventually open your iOS application:
es: Esto iniciará el simulador de iOS, instalará tu aplicación y la iniciará. Vas a observar cómo se inicia el simulador y cómo se abre tu aplicación iOS:

source: Hello World Tutorial 5 window, on iOS
es: Ventana del Tutorial 5 de Hello World, en iOS

source: If you know ahead of time which iOS simulator you want to target, you can tell Briefcase to use that simulator by providing a ``-d`` (or ``--device``) option. Using the name of the device you selected when you built your application, run:
es: Si sabes de antemano a qué simulador iOS quieres dirigirte, puedes decirle a Briefcase que utilice ese simulador proporcionando una opción ``-d`` (o ``--device``). Utilizando el nombre del dispositivo que seleccionaste cuando creaste tu aplicación, ejecuta:

source: If you have multiple iOS versions available, Briefcase will pick the highest iOS version; if you want to pick a particular iOS version, you tell it to use that specific version:
es: Si tienes varias versiones de iOS disponibles, Briefcase elegirá la versión de iOS más alta; si quieres elegir una versión de iOS en particular, dile que utilice esa versión específica:

source: Or, you can name a specific device UDID:
es: O bien, puede nombrar un UDID de dispositivo específico:

source: Next steps
es: Siguientes pasos

source: We've now got an application on our phone! Is there anywhere else we can deploy a BeeWare app? Turn to :doc:`Tutorial 6 <../tutorial-6>` to find out...
es: ¡Ya tenemos una aplicación en nuestro teléfono! ¿Hay algún otro lugar donde podamos desplegar una aplicación BeeWare? Visita :doc:`Tutorial 6 <../tutorial-6>` para averiguarlo...
